Version2/TestTool-NOP.13.12.SR1/TestTool.Setup/Requests/MediaConf/CreateProfile/TC.MC.NVT.05_REQ_07.xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope
 xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
 xmlns:trt="http://www.onvif.org/ver10/media/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <trt:CreateProfile>
      <trt:Name>Test Profile</trt:Name>
      <trt:Token>t2345678123456781234567812345678123456781234567812345678123456781</trt:Token>
    </trt:CreateProfile>
  </soap:Body>
</soap:Envelope>