soap_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
  <s:Header>
    <Security s:mustUnderstand="1" xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <UsernameToken>
        <Username>test</Username>
        <Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">3EDmJ4xCxMmVLOLT1V0cJqfzaqw=</Password>
        <Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">RJwQ1z4tkj2RvtKmplzUqA==</Nonce>
        <Created xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2025-12-18T07:39:55.987Z</Created>
      </UsernameToken>
    </Security>
  </s:Header>
  <s:Body>
    <trt:GetSnapshotUri xmlns:trt="http://www.onvif.org/ver10/media/wsdl">
    <trt:ProfileToken>main_profile</trt:ProfileToken>
  </trt:GetSnapshotUri>
  </s:Body>
</s:Envelope>