sample/media/GetProfiles.req.xml

<?xml version="1.0" encoding="utf-8"?>
<Envelope xmlns="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:trt="http://www.onvif.org/ver10/media/wsdl">
  <Body>
    <trt:GetProfiles/>
  </Body>
</Envelope>
