xml/GetProfiles-auth.xml

<?xml version='1.0' encoding='utf-8'?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:tds="http://www.onvif.org/ver10/device/wsdl" xmlns:trt="http://www.onvif.org/ver10/media/wsdl" xmlns:tt="http://www.onvif.org/ver10/schema">
	<SOAP-ENV:Body>
		<trt:GetProfiles/>
	</SOAP-ENV:Body>
	<SOAP-ENV:Header>
		<Security SOAP-ENV:mustUnderstand="1" xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<UsernameToken>
				<Created xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">{ONVIF_XML_CREATED}</Created>
				<Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">{ONVIF_XML_NONCE}</Nonce>
				<Username>{ONVIF_XML_USERNAME}</Username>
				<Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">{ONVIF_XML_PASSWORD}</Password>
			</UsernameToken>
		</Security>
	</SOAP-ENV:Header>
</SOAP-ENV:Envelope>